In [10]:
#1.	Create a series using a list (my_list) and an array (my_arr). Both can be of length 10
import numpy as np
import pandas as pd
x=np.array([11,12,13,14,15,16,17,18,19,20])
my_arr=pd.Series(x)
print(my_arr)

my_list=pd.Series([1,2,3,4,5,6,7,8,9,10])
my_list

0    11
1    12
2    13
3    14
4    15
5    16
6    17
7    18
8    19
9    20
dtype: int32

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [6]:
#2.	Create a series using a dictionary from above my_list and my_arr as key and value pairs
#(Hint: my_dict = dict(zip(my_list, my_arr))

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [13]:
my_dict=dict(zip(my_list,my_arr))
print(my_dict)
pd.Series(my_dict)

{1: 11, 2: 12, 3: 13, 4: 14, 5: 15, 6: 16, 7: 17, 8: 18, 9: 19, 10: 20}

1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
dtype: int64

In [67]:
#3.	Create 3 series of different data types and concatenate them across axis = 1
# dic={'x':2,'y':3}
# float_series=pd.Series(dic,index=['x','y','z'])
int_series=pd.Series([45,76,88])
float_series=pd.Series([6.7,8.9,9.5])
string_series=pd.Series(["Muthu","Naresh","Divya"])
pd.concat([float_series,int_series,string_series],axis=1)

     0   1       2
0  6.7  45   Muthu
1  8.9  76  Naresh
2  9.5  88   Divya

In [54]:
#4.	Create a data frame using a list of list and dictionary using a forced index
sales=[{'Name':'Muthu','age':31 ,'address':"Nellai"},{'Name':'Div','age':30 ,'address':"Nagercoil"},{'Name':'Naru','age':3 ,'address':"chennai"}]
s1=pd.DataFrame(sales)
print(s1)

sales={'Name':["Muthu","Div","Naru"] , "Age":[45,56,76] , "Address":["Chennai","Nellai","Nagercoil"]}
df1=pd.DataFrame(sales,index=['x','y','z'])
print(df1)

    Name    address  age
0  Muthu     Nellai   31
1    Div  Nagercoil   30
2   Naru    chennai    3
    Name  Age    Address
x  Muthu   45    Chennai
y    Div   56     Nellai
z   Naru   76  Nagercoil

In [104]:
#5.	Create a data frame with 2 integer columns and perform at least 3 numerical operation and storing them as adjacent columns. 
#Your final df should contain 5 columns
dic={'a':[3,4],'b':[7,8]}
df=pd.DataFrame(dic,index=[1,2])
print(df)
df['sum']=df['b']+df['a']
df['diff']=df['b']-df['a']
df['div']=df['b']//df['a']
df

   a  b
1  3  7
2  4  8

   a  b  sum  diff  div
1  3  7   10     4    2
2  4  8   12     4    2

In [105]:
#6.	Delete 2 columns using del and drop function

df1=df.drop(['sum','div'],axis=1)
print(df1)

del df["diff"]
print(df)

   a  b  diff
1  3  7     4
2  4  8     4
   a  b  sum  div
1  3  7   10    2
2  4  8   12    2

In [222]:
#7.	Create a data frame with shape 10x5 and extract only those records that are beyond row# 5
sample={"Names":["Naru","Div","Muthu","vani","krish","diva","Achu","Ishu","Uma","Babu"],"Ages":[45,56,67,78,89,12,23,34,33,32],
       "Favourite":["Tea","coffee","choco","papad","pulav","Maagi","ice-cream","baloon","animals","birds"],
       "Rating":[11,12,13,14,15,16,17,18,19,20],"Score":[10,20,30,40,50,60,70,80,90,100]}
df_x=pd.DataFrame(sample,index=[1,2,3,4,5,6,7,8,9,10])
print(df_x)
df_x.loc[6:,]

    Names  Ages  Favourite  Rating  Score
1    Naru    45        Tea      11     10
2     Div    56     coffee      12     20
3   Muthu    67      choco      13     30
4    vani    78      papad      14     40
5   krish    89      pulav      15     50
6    diva    12      Maagi      16     60
7    Achu    23  ice-cream      17     70
8    Ishu    34     baloon      18     80
9     Uma    33    animals      19     90
10   Babu    32      birds      20    100

   Names  Ages  Favourite  Rating  Score
6   diva    12      Maagi      16     60
7   Achu    23  ice-cream      17     70
8   Ishu    34     baloon      18     80
9    Uma    33    animals      19     90
10  Babu    32      birds      20    100

In [207]:
#8.	Add a last row in a data frame and reset their index
df1=pd.Series([1,2,3])
print(df1)
df2=pd.Series([5])
print(df2)
df=df1.append(df2)
print(df)
df=df.reset_index()
df

0    1
1    2
2    3
dtype: int64
0    5
dtype: int64
0    1
1    2
2    3
0    5
dtype: int64

   index  0
0      0  1
1      1  2
2      2  3
3      0  5

In [248]:
#9.	Slice all the rows but last 3 columns
sample={"Names":["Naru","Div","Muthu","vani","krish","diva","Achu","Ishu","Uma","Babu"],"Ages":[45,56,67,78,89,12,23,34,33,32],
       "Favourite":["Tea","coffee","choco","papad","pulav","Maagi","ice-cream","baloon","animals","birds"],
       "Rating":[11,12,13,14,15,16,17,18,19,20],"Score":[10,20,30,40,50,70,70,80,90,100]}
df_x=pd.DataFrame(sample,index=[1,2,3,4,5,6,7,8,9,10])
print(df_x)
df=df_x.iloc[:,2:]
df

    Names  Ages  Favourite  Rating  Score
1    Naru    45        Tea      11     10
2     Div    56     coffee      12     20
3   Muthu    67      choco      13     30
4    vani    78      papad      14     40
5   krish    89      pulav      15     50
6    diva    12      Maagi      16     70
7    Achu    23  ice-cream      17     70
8    Ishu    34     baloon      18     80
9     Uma    33    animals      19     90
10   Babu    32      birds      20    100

    Favourite  Rating  Score
1         Tea      11     10
2      coffee      12     20
3       choco      13     30
4       papad      14     40
5       pulav      15     50
6       Maagi      16     70
7   ice-cream      17     70
8      baloon      18     80
9     animals      19     90
10      birds      20    100

In [249]:
#10.	Take first and last 5 observations using pre defined pandas function 
df_x
print(df_x.head())
print(df_x.tail())

   Names  Ages Favourite  Rating  Score
1   Naru    45       Tea      11     10
2    Div    56    coffee      12     20
3  Muthu    67     choco      13     30
4   vani    78     papad      14     40
5  krish    89     pulav      15     50
   Names  Ages  Favourite  Rating  Score
6   diva    12      Maagi      16     70
7   Achu    23  ice-cream      17     70
8   Ishu    34     baloon      18     80
9    Uma    33    animals      19     90
10  Babu    32      birds      20    100

In [250]:
#11.	Using any of the existing data frame, implement dtypes, shape and size functions
print(df_x.size)
print(df_x.shape)
df_x.dtypes

50
(10, 5)

Names        object
Ages          int64
Favourite    object
Rating        int64
Score         int64
dtype: object

In [251]:
#12.	Calculate the sum of the values across axis=1 for a data frame.
#Here, string columns will be not considered by default while performing calculations
df_x.sum(1)

1      66
2      88
3     110
4     132
5     154
6      98
7     110
8     132
9     142
10    152
dtype: int64

In [252]:
#13.	Calculate mean, median, standard deviation and mode for an integer column of an existing data frame
print(df_x["Ages"].mean())
print(df_x["Ages"].median())
print(df_x["Rating"].std())
print(df_x["Score"].mode())

46.9
39.5
3.0276503540974917
0    70
dtype: int64

In [256]:
#14.	Take min and max of a column, also describe the basic statistics of a data frame
print(df_x["Ages"].min())

print(df_x["Ages"].max())
df_x.describe()

12
89

            Ages    Rating       Score
count  10.000000  10.00000   10.000000
mean   46.900000  15.50000   56.000000
std    24.946387   3.02765   30.623158
min    12.000000  11.00000   10.000000
25%    32.250000  13.25000   32.500000
50%    39.500000  15.50000   60.000000
75%    64.250000  17.75000   77.500000
max    89.000000  20.00000  100.000000

In [257]:
#15.	Rename the columns with just 3 characters across
df_x.rename(columns={"Ages":"co1","Rating":"co2","Score":"co3"})

    Names  co1  Favourite  co2  co3
1    Naru   45        Tea   11   10
2     Div   56     coffee   12   20
3   Muthu   67      choco   13   30
4    vani   78      papad   14   40
5   krish   89      pulav   15   50
6    diva   12      Maagi   16   70
7    Achu   23  ice-cream   17   70
8    Ishu   34     baloon   18   80
9     Uma   33    animals   19   90
10   Babu   32      birds   20  100

In [289]:
#16.	Apply sort to the first column and reset the index
df=pd.DataFrame(np.random.randn(5,2),index=[5,3,4,2,1],columns=["col1","col2"])
print(df)
df1=df["col1"].sort_index()
print(df1)
df.reset_index()

       col1      col2
5  0.453059 -1.116453
3 -0.909591  1.406674
4  1.748517 -0.043186
2 -0.607481  1.263678
1 -2.043237  0.671255
1   -2.043237
2   -0.607481
3   -0.909591
4    1.748517
5    0.453059
Name: col1, dtype: float64

   index      col1      col2
0      5  0.453059 -1.116453
1      3 -0.909591  1.406674
2      4  1.748517 -0.043186
3      2 -0.607481  1.263678
4      1 -2.043237  0.671255

In [273]:
#17.	Using iloc, take the first 4 observations and last 2 columns
print(df_x)
df_x.iloc[:4,3:]

    Names  Ages  Favourite  Rating  Score
1    Naru    45        Tea      11     10
2     Div    56     coffee      12     20
3   Muthu    67      choco      13     30
4    vani    78      papad      14     40
5   krish    89      pulav      15     50
6    diva    12      Maagi      16     70
7    Achu    23  ice-cream      17     70
8    Ishu    34     baloon      18     80
9     Uma    33    animals      19     90
10   Babu    32      birds      20    100

   Rating  Score
1      11     10
2      12     20
3      13     30
4      14     40

In [298]:
#18.	Create a data frame with multiple Nan records and fill them with a generic number
df_x=pd.DataFrame(np.random.randn(5,3),index=[1,2,3,4,5],columns=["col1","col2","col3"])
print(df_x)
df_modified=df_x.reindex([3,4,5,6,7])
print(df_modified)
df_filled=df_modified.fillna(100)
df_filled

       col1      col2      col3
1  0.624197  0.776967 -1.150544
2  0.829840 -1.207608 -2.244954
3 -1.065637 -0.246311  0.471583
4  0.922679  0.826999 -1.218430
5 -0.931238 -1.201135 -0.386472
       col1      col2      col3
3 -1.065637 -0.246311  0.471583
4  0.922679  0.826999 -1.218430
5 -0.931238 -1.201135 -0.386472
6       NaN       NaN       NaN
7       NaN       NaN       NaN

         col1        col2        col3
3   -1.065637   -0.246311    0.471583
4    0.922679    0.826999   -1.218430
5   -0.931238   -1.201135   -0.386472
6  100.000000  100.000000  100.000000
7  100.000000  100.000000  100.000000

In [303]:
#19.	Count the number of null records in a column
print(df_modified.isna().sum())
print(df_modified["col2"].isnull().sum())

col1    2
col2    2
col3    2
dtype: int64
2

In [317]:
#20.	Please implement the group by and merge function with multiple conditions and get accustomed to it.
df_x=pd.DataFrame({"id":[67,78,89],"Names":["diva","div","vani"],"Scores":[77,66,99]})
print(df_x)
df_y=pd.DataFrame({"id":[90,79,89],"Names":["krish","div","vani"],"Scores":[77,100,99]})
print(df_y)

   id Names  Scores
0  67  diva      77
1  78   div      66
2  89  vani      99
   id  Names  Scores
0  90  krish      77
1  79    div     100
2  89   vani      99

In [318]:
print(pd.merge(df_x,df_y,on=["id","Scores"]))

   id Names_x  Scores Names_y
0  89    vani      99    vani
   id Names_x  Scores Names_y
0  89    vani      99    vani
1  90     NaN      77   krish
2  79     NaN     100     div
   id Names_x  Scores Names_y
0  67    diva      77     NaN
1  78     div      66     NaN
2  89    vani      99    vani

In [320]:
print(df_x)
print(df_y)
print(pd.merge(df_x,df_y,on=["id","Scores"],how="right"))
print(pd.merge(df_x,df_y,on=["id","Scores"],how="left"))

   id Names  Scores
0  67  diva      77
1  78   div      66
2  89  vani      99
   id  Names  Scores
0  90  krish      77
1  79    div     100
2  89   vani      99
   id Names_x  Scores Names_y
0  89    vani      99    vani
1  90     NaN      77   krish
2  79     NaN     100     div
   id Names_x  Scores Names_y
0  67    diva      77     NaN
1  78     div      66     NaN
2  89    vani      99    vani

In [322]:
sample={"Names":["Naru","Div","Muthu","vani","krish","diva","Achu","Ishu","Uma","Babu"],"Ages":[45,56,67,78,89,12,23,34,33,32],
       "Favourite":["Tea","coffee","choco","papad","pulav","Maagi","ice-cream","baloon","animals","birds"],
       "Rating":[11,12,13,14,15,16,17,18,19,20],"Score":[10,20,30,40,50,70,70,80,90,100]}
df_x=pd.DataFrame(sample,index=[1,2,3,4,5,6,7,8,9,10])
print(df_x)
df_x.groupby(["Score"])["Ages"].sum()

    Names  Ages  Favourite  Rating  Score
1    Naru    45        Tea      11     10
2     Div    56     coffee      12     20
3   Muthu    67      choco      13     30
4    vani    78      papad      14     40
5   krish    89      pulav      15     50
6    diva    12      Maagi      16     70
7    Achu    23  ice-cream      17     70
8    Ishu    34     baloon      18     80
9     Uma    33    animals      19     90
10   Babu    32      birds      20    100

Score
10     45
20     56
30     67
40     78
50     89
70     35
80     34
90     33
100    32
Name: Ages, dtype: int64

In [324]:
df_x.groupby(["Score"])["Ages","Names"].sum()

       Ages
Score
10       45
20       56
30       67
40       78
50       89
70       35
80       34
90       33
100      32

In [326]:
df_x.groupby(["Score"])["Ages","Rating"].agg([np.mean,np.median,np.std,np.var])

       Ages                        Rating
       mean median       std   var   mean median       std  var
Score
10     45.0   45.0       NaN   NaN   11.0   11.0       NaN  NaN
20     56.0   56.0       NaN   NaN   12.0   12.0       NaN  NaN
30     67.0   67.0       NaN   NaN   13.0   13.0       NaN  NaN
40     78.0   78.0       NaN   NaN   14.0   14.0       NaN  NaN
50     89.0   89.0       NaN   NaN   15.0   15.0       NaN  NaN
70     17.5   17.5  7.778175  60.5   16.5   16.5  0.707107  0.5
80     34.0   34.0       NaN   NaN   18.0   18.0       NaN  NaN
90     33.0   33.0       NaN   NaN   19.0   19.0       NaN  NaN
100    32.0   32.0       NaN   NaN   20.0   20.0       NaN  NaN